{
  "backend/main.mo": "Main backend actor managing user profiles, menu items, gallery images, and access control, with admin‑gated mutations and public queries.",
  "backend/migration.mo": "Migration module converting old order records to a new format with string principals and default contact info while preserving other actor data.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs for authentication and admin access changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend admin and public pages, components, and hooks.",
  "frontend/index.css": "Empty stylesheet placeholder for global site styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Top‑level React router configuration defining all public and admin routes with AdminGuard protection for admin pages.",
  "frontend/src/components/AnnouncementBar.tsx": "Displays dismissible active promotions based on date ranges, pulling data from useGetPromotions.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin routes by checking authentication and admin status, showing appropriate messages or content.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling login/logout via Internet Identity with loading and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated non-admin users on admin routes to create a basic profile.",
  "frontend/src/components/Footer.tsx": "Site footer showing contact info, quick links, social icons, and opening hours fetched from backend data.",
  "frontend/src/components/GalleryLightbox.tsx": "Lightbox dialog that displays a selected image with navigation controls and an optional caption.",
  "frontend/src/components/HeaderNav.tsx": "Responsive site header with navigation links, custom pages, and mobile menu handling.",
  "frontend/src/components/OrderCart.tsx": "Shopping cart component showing items, quantity controls, removal, and total price.",
  "frontend/src/components/SiteLayout.tsx": "Top-level layout including header, footer, announcement bar, main content, and profile modal.",
  "frontend/src/components/TestimonialsCarousel.tsx": "Carousel that displays customer testimonials with ratings and author info.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks for fetching and mutating user profiles, roles, and admin status using the actor API with react-query.",
  "frontend/src/hooks/useContactInfo.ts": "Hooks to get and update contact info from the actor with react-query and cache invalidation.",
  "frontend/src/hooks/useExport.ts": "Exports backend data via the actor API and triggers a JSON file download.",
  "frontend/src/hooks/useGallery.ts": "Hooks to fetch, add, and remove gallery images with automatic cache updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login, and logout via a React context.",
  "frontend/src/hooks/useMenu.ts": "Hooks to retrieve and manage menu items including add, update, and remove operations.",
  "frontend/src/hooks/useOrders.ts": "Hooks for retrieving orders and performing order operations like placing and updating status.",
  "frontend/src/hooks/usePages.ts": "Hooks to fetch, create, update, and delete CMS pages with targeted cache invalidation.",
  "frontend/src/hooks/usePromotions.ts": "Hooks to list, add, and remove promotions through the actor API.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing.",
  "frontend/src/hooks/useSeoMeta.ts": "Hooks to fetch and update SEO metadata for specific pages.",
  "frontend/src/hooks/useTestimonials.ts": "Hooks to list, add, and delete testimonials with cache refresh.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, typography, and utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with heritage, women-owned, and community sections using SEO metadata and contact info hooks.",
  "frontend/src/pages/admin/AdminAdminsPage.tsx": "Admin panel for adding or removing admin users by principal ID with role assignment and permission checks.",
  "frontend/src/pages/admin/AdminContactPage.tsx": "Admin form to view and update contact information including address, phone, email, hours, and map URL.",
  "frontend/src/pages/admin/AdminExportPage.tsx": "Admin page providing full data export functionality with a single export action and status messaging.",
  "frontend/src/pages/admin/AdminGalleryPage.tsx": "Admin interface for uploading, listing, and deleting gallery images with captions and categories.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Layout wrapper for all admin pages with navigation sidebar and top bar including login and site-return buttons.",
  "frontend/src/pages/admin/AdminMenuPage.tsx": "Provides a CRUD interface for menu items with dialogs for adding and editing items using custom hooks.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders with filtering, status updates, and detailed order viewing via dialogs.",
  "frontend/src/pages/admin/AdminPagesPage.tsx": "Manages custom pages with CRUD operations and SEO metadata editing through a form dialog.",
  "frontend/src/pages/admin/AdminPromotionsPage.tsx": "Handles creation and deletion of promotions, including image upload and date fields.",
  "frontend/src/pages/admin/AdminSeoPage.tsx": "Allows editing of SEO metadata for predefined site pages using tabbed forms.",
  "frontend/src/pages/admin/AdminTestimonialsPage.tsx": "Admin page to list, add, and delete testimonials using dialog forms and testimonial hooks.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information including address, phone, WhatsApp, and email along with SEO metadata.",
  "frontend/src/pages/CustomPage.tsx": "Dynamically renders custom CMS-driven pages by slug, falling back to a not‑found message if missing.",
  "frontend/src/pages/GalleryPage.tsx": "Shows an image gallery with category filtering, lazy animations, a lightbox, and SEO data.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, highlights, menu and promotion data, testimonials, and SEO metadata.",
  "frontend/src/pages/MenuPage.tsx": "Displays menu items with category filters, daily specials, and integrated SEO and contact info.",
  "frontend/src/pages/OrderReservePage.tsx": "Page for placing orders or table reservations, managing cart items, customer details, and submitting orders via hooks.",
  "frontend/src/seo/SeoHead.tsx": "Component that sets page-level SEO metadata and injects structured data for business info, menu, and promotions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Project state file describing site goals, design direction, requirements, and known issues for the restaurant website."
}